// http://acmp.ru/index.asp?main=task&id_task=163
// Уравнение для 5 класса!
// (Время: 1 сек. Память: 16 Мб Сложность: 25%)
// Уравнение для пятиклассников представляет собой строку длиной 5 символов. 
// Второй символ строки является либо знаком '+' (плюс) либо '-' (минус), 
// четвёртый символ — знак '=' (равно). Из первого, третьего и пятого символов 
// ровно два являются цифрами из диапазона от 0 до 9, и один — буквой x,
// обозначающей неизвестное.

// Требуется написать программу, которая позволит решить данное уравнение 
// относительно x.

// Входные данные

// Входной файл INPUT.TXT состоит из одной строки, в которой записано уравнение.

// Выходные данные

// В выходной файл OUTPUT.TXT выведите целое число — значение x.

#include <fstream>
#include <string>

using namespace std;

int main()
{
	ifstream in("INPUT.TXT");
	string s;
	getline(in, s);

	return 0;
}
